# Medfomってなあに？
ただの一般人である僕ですが、僕は昔から大きな理想を描いていたりします。それは、「Manage all media with freedom. (すべてのメディアの管理を自由に)」というキャッチコピーです。気になった方のみ読んでください。

今の時代、色々なデータが増えてきた中、それらのデータを意識せず扱えたらいいなと思ったんです。たとえば…
- ビデオカメラ・一眼・スマホ・パソコン・ゲームで撮った写真、管理どうしよう
- 曲・ボイスレコーダー・CD、色々とありすぎる
- 防犯カメラ・動画画像音声素材・編集データ・プロジェクト、種類が多すぎる！
- こっちだと開けるのにこっちだと開けないの？

データというのは「アプリ」「メディア」の大きく２種類に分けられます。そのうち「メディア」とは書類データも含んでいいです。それらメディアデータって、拡張子・フォーマットなどが関わっており、それらのフォーマットはそれぞれの企業が作っています。その企業が作ったフォーマットは統一されない場合もあり、扱いが大変です。対応したり、互換性を持ったりすることで対処は可能ですけどね。

でも、そんなことをしているくらいなら、全部１つにまとめて、一目で全部見れたらいいなと思ったんです。
- 写真・音声・映像は全部まとめて管理できて、ジャンルごとに分けれるし、検索できるしっていう便利さが欲しい。
- ドキュメント・スライド・表計算・プロジェクトは整理整頓しながら、邪魔にならないようにまとめたい。

その理想を叶えるのがMedfomです。さらに、Medfomの裏の目標も教えます。
- 見てて楽しいし直感的
- 欲しい機能が優先的に追加される
- 互換性を重視しつつ上位環境では超高速
- 安く見える新しい料金設定

これが目標です。誰でも好きな見た目にできるし、困ってた機能はすぐ使えるし、古いデバイスでも動くし、試したい時に少額で全機能使えちゃう。それはすごく嬉しいことですから。

まだ夢の中の夢です。でも、構想には続きがあります。
- まず、２０２５年現在の「音楽bot」プロジェクトは一気にWebGUIに対応したのち、音楽プレイヤーとなり、機能を拡張する予定です。そしたら曲を管理する専門になります。
- 収益が出てきたら、「データベースマネージャー」を元に新しくクラウドストレージを開放し、誰でもデータが保存できるようにします。
- その後「写真・映像」にも対応し、好きなだけデータを保存できるようにします。
- 「アーカイブストレージ」という新しい概念で、誰でも安全に長期間データを持てるようになります。
- 書類データにも対応したり、OSを作ったりして、拡張性と利便性を提供します。

夢すぎますね。創作だと思ってください。
